examples/circularCylinder/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "100";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
184800
(
0.000128877
9.50887e-14
-0.00013192
3.0429e-06
0.000258208
-3.54973e-13
-0.000129331
0.000382313
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
440
(
0.0421611
0.0421611
0.0421611
0.0421611
0.0421611
0.0421611
0.0421611
0.0421611
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
360
(
0.0742444
0.0742444
0.0742444
0.0742444
0.0742444
0.0742444
0.0742444
0.0742444
...
)
;
    }
    cylinder
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            cyclic;
        value           nonuniform List<scalar> 
6400
(
-1.46211e-13
-1.13259e-13
1.38624e-14
1.84414e-13
3.8504e-13
5.91427e-13
7.81533e-13
9.41502e-13
...
)
;
    }
    back
    {
        type            cyclic;
        value           nonuniform List<scalar> 
6400
(
1.46211e-13
1.13259e-13
-1.38624e-14
-1.84414e-13
-3.8504e-13
-5.91427e-13
-7.81533e-13
-9.41502e-13
...
)
;
    }
}


// ************************************************************************* //
