examples/circularCylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          440;
        startFace       184800;
    }
    outlet
    {
        type            patch;
        nFaces          360;
        startFace       185240;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       185600;
    }
    front
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          6400;
        startFace       186400;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back;
    }
    back
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          6400;
        startFace       192800;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front;
    }
)

// ************************************************************************* //
